export const militaryMilitaryRanks = [
    'Генерал армии',
    'Генерал-полковник',
    'Генерал-лейтенант',
    'Генерал-майор',
    'Полковник',
    'Подполковник',
    'Майор',
    'Капитан',
    'Старший лейтенант',
    'Лейтенант',
    'Мастер-сержант',
    'Штаб-сержант',
    'Сержант первого класса',
    'Сержант второго класса',
    'Сержант третьего класса',
    'Старший сержант',
    'Сержант',
    'Младший сержант',
    'Ефрейтор',
    'Рядовой'
]

export const shipMilitaryRanks = [
    'Адмирал',
    'Вице-адмирал',
    'Контр-адмирал',
    'Капитан первого ранга',
    'Капитан второго ранга',
    'Капитан третьего ранга',
    'Капитан-лейтенант',
    'Старший лейтенант',
    'Лейтенант',
    'Мастер-старшина',
    'Штаб-старшина',
    'Старшина первого класса',
    'Старшина второго класса',
    'Старшина третьего класса',
    'Главный старшина',
    'Старшина первой статьи',
    'Старшина второй статьи',
    'Старший матрос',
    'Матрос'
]

export const militaryRanks = [
    'Верховный Главнокомандующий ВС РК',
    ...militaryMilitaryRanks,
    ...shipMilitaryRanks,
]